zeroWin/BP_MSP430/main.c
//******************************************************************************
//  MSP430F149-Noninvasive Blood Pressure Monitor
//  Nov 2013
//  Built with IAR Embedded Workbench Version: 5.3
//******************************************************************************
#include  <msp430f1611.h>
#include  <math.h>
#include  "typedefs.h"
#include "hal_oled.h"
#include "hal_battery_monitor.h"
#include "hal_type.h"
#include "hal_uart_cc2530.h"
#include "hal_rtc_ds1302.h"
#include "hal_delay.h"
#include "main.h"
#include "hal_BP_measure.h"
#include "hal_SDcard.h"
#include "exfuns.h"
#include "ff.h"
/*****************************************************************************
变量定义
******************************************************************************/
u32 BP_DC;
u32 BP_AC;
u16 BP_MAX;
u16 BP_MIN;
u16 AC_MAX;
int BP_MID;
int BP_P2P;
int BP_Low;
int BP_High;
float k1=0;
float k2=0;
float abp=0;
float bp;
int SYS;
int DIA;
u32 pressure;
int display_time=0;
u8  show=0;
struct Pointss
{
  int bp;
  int p2p;
} Points[100];                                     //DC、AC矩阵
unsigned int n_P=0;                                //number of points
unsigned int last_is_low=0;

unsigned int delay_times=0;
unsigned char step=101;

int Prepressure=3500;
//int Prepressure=4000;
int Device_waite_time1;
/*****************************************************************************
函数声明
*****************************************************************************/
void Init_Clock();
void Init_Port1();
void Init_Port2();
void Init_Port4();
void Init_Port6();
void Init_TimerA();
void Stop_BPMeasure(void);
void Start_BPMeasure(void);
extern void usDelay(int microeconds);
extern void Write_8402(u16 data_8402);
extern void delay_ms(u16 nms);
extern void delay_s(u16 ns);
extern void PUMP_ON(u16 motorspeed);
extern void PUMP_OFF(void);
extern void VALVE_ON(void);
extern void VALVE_OFF(void);
extern void write_oled_command(unsigned char ucCmd);
extern void write_oled_data(unsigned char ucData);
unsigned int adc2mmhg(unsigned int adc);
void RBUF_PROCESS(void);
int abs(int a);
void Find_Hign_Low_BP();
void SendDCAndACToCC2530(uint16 DC_temp,uint16 AC_temp,uint16 BP_HIGH_temp,uint16 BP_LOW_temp);
void SendBP_HighAndLowoCC2530(uint16 BP_HIGH_temp,uint16 BP_LOW_temp);

BPSystemStatus_t BPSystemStatus;
uint8 writeNum;
uint8 bufferFullFlag;
/*****************************************************************************
主程序
*****************************************************************************/
void main(void)
{
  WDTCTL = WDTPW + WDTHOLD;                //关闭看门狗电路
  uint16 *dataTemp;
  Init_Clock();
  Init_Port1();
  Init_Port2();
  P2OUT &= ~BIT4;
  
  //HalBattMonInit();   //Initialize Battery monitor
  // Init UART to CC2530
  UART1_Config_Init(); 
  // RTC初始化
  HalRTCInit(); 
  // Initialize OLED
  HalOledInit();    
  //HalOledShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
  // SD卡初始化
//  while(SD_Initialize());
//  exfuns_init();
//  f_mount(0,fs);      // 挂载文件系统  
//  f_mkdir("0:S");     // 创建文件夹  
  
  //Init_Port4();
  Init_Port6();                             
  //VALVE_OFF();                             //通道0 控制电磁阀
  VALVE_ON();
  PUMP_OFF();                              //通道1 控制气泵
  Init_TimerA();
  step=101;
  HalOledShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
  HalOledShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
  Show_Wait_Symbol("Off_IDLE");    
  delay_ms(10);
  BPSystemStatus =  BP_OFFLINE_IDLE;
  _EINT();
  while(1)
  {
    if(BPSystemStatus == BP_OFFLINE_IDLE || BPSystemStatus == BP_ONLINE_IDLE)       //离线等待状态
    {                                              
      //step=101;
      HalOledOnOff(HAL_OLED_MODE_ON);                           //打开显示器 
      if(Device_waite_time1 <15000)
      {
        delay_ms(2);
        Device_waite_time1++;
      }
      else                                     //等待15s，如果无操作则进入休眠状态
      {
        if(BPSystemStatus == BP_OFFLINE_IDLE) // 离线空闲状态
          BPSystemStatus = BP_OFF_SLEEP;
        if(BPSystemStatus == BP_ONLINE_IDLE) // 在线空闲状态
          BPSystemStatus = BP_ON_SLEEP;
      }
    }
    else if(BPSystemStatus == BP_OFF_SLEEP || BPSystemStatus == BP_ON_SLEEP)       //进入睡眠状态
    {
      HalOledOnOff(HAL_OLED_MODE_OFF);           //关闭显示器        
      _BIS_SR(LPM0_bits + GIE);                  //进入低功耗
    }
    else if(BPSystemStatus == BP_OFFLINE_MEASURE || BPSystemStatus == BP_ONLINE_MEASURE)     //测量状态
    {
      if(bufferFullFlag == 1) // buffer满了
      {
        HalBPMeasReadFromBuf( &dataTemp );
        if(BPSystemStatus == BP_OFFLINE_MEASURE) // 离线测量状态
        { // 写入SD卡      
        }
        if(BPSystemStatus == BP_ONLINE_MEASURE) // 在线测量状态
        {
          //发送给CC2530
          UART1_Send_Buffer((uint8 *)dataTemp,68);
        }
        bufferFullFlag = 0;
      }
      if(step==30) // step=30说明测量结果
      { 
        Find_Hign_Low_BP();                    //计算高低血压值
        step = 101;
        Device_waite_time1 = 0;
        // 释放申请的空间
        HalBPMeasStop();
        if(BPSystemStatus == BP_OFFLINE_MEASURE) // 离线测量状态
        {
          Show_Wait_Symbol("Off_IDLE");
          BPSystemStatus = BP_OFFLINE_IDLE;
        }
        if(BPSystemStatus == BP_ONLINE_MEASURE) // 在线测量状态
        {
          // 发送最后结果
          SendBP_HighAndLowoCC2530(BP_High,BP_Low);
          Show_Wait_Symbol("On_IDLE ");
          BPSystemStatus = BP_ONLINE_IDLE;
        }
        HalOledShowString(0,34,32,"        ");  //8个空格，完全清空
        
        if(BP_High<100)
          HalOledShowNum(SPO2_Show2Num_Start_X,SPO2_Show2Num_Start_Y,BP_High,2,32);              
        else
          HalOledShowNum(SPO2_Show3Num_Start_X,SPO2_Show3Num_Start_Y,BP_High,3,32);
        if(BP_Low < 100)
          HalOledShowNum(HR_Show2Num_Start_X,HR_Show2Num_Start_Y,BP_Low,2,32);              
        else
          HalOledShowNum(HR_Show3Num_Start_X ,HR_Show3Num_Start_Y,BP_Low,3,32);
      }
    } 
  }              
}

/*****************************************************************************
定时器A中断服务程序
*****************************************************************************/
uint16 aa = 2000;
#pragma vector=TIMERA0_VECTOR
__interrupt void Timer_A (void)
{
     static long BP_AC_AVE=0;  
     static long BP_AC_AVE_times=0;
     P2OUT ^= 0x10;     
     ADC12CTL0 |= ADC12SC;                     // Start conversion
     BP_DC = ADC12MEM0;                        // Move A0 results
     BP_AC = ADC12MEM1;                        // Move A1 results
     if(delay_times<30000)
       delay_times++;                            //延时次数累加
     if(display_time==255)
     {
       display_time=0;
       show=1;
     }
     else
     {
       display_time++;
     }       
     //pressure=((BP_DC*3.3/4095)/233.56)*1000*15.52;
     bp=((BP_DC*3.3/4095)/233.56)*1000*15.52;
     pressure=(u32)(bp);
     if(show==1)
     {
       show=0;
       if(pressure<10)
       {
         HalOledShowNum(SPO2_Show2Num_Start_X+27,SPO2_Show2Num_Start_Y,0,1,32);
         HalOledShowNum(SPO2_Show2Num_Start_X+43,SPO2_Show2Num_Start_Y,0,1,32);
         HalOledShowNum(SPO2_Show2Num_Start_X+59,SPO2_Show2Num_Start_Y,pressure,1,32);
       }
       else if((pressure<100)&&(pressure>9))
       {
         HalOledShowNum(SPO2_Show2Num_Start_X+27,SPO2_Show2Num_Start_Y,0,1,32);
         HalOledShowNum(SPO2_Show2Num_Start_X+43,SPO2_Show2Num_Start_Y,pressure,2,32);
       }
       else
         HalOledShowNum(SPO2_Show3Num_Start_X+27,SPO2_Show3Num_Start_Y,pressure,3,32);         
     }
     switch(step)
     {       
     case 0:                                    //变量初始化
       delay_times=0;
       BP_AC_AVE=0;
       BP_AC_AVE_times=0;
       BP_MIN=BP_AC_AVE;
       BP_MAX=0;
       AC_MAX=0;
       last_is_low=0;              
       step=5;
       break;
     
     case 5:                                   //BP_AC基准求取并控制气泵充气
       BP_AC_AVE+=BP_AC;
       BP_AC_AVE_times++;
       if(BP_AC_AVE_times>=128)
       { 
         BP_AC_AVE=BP_AC_AVE>>7;
         PUMP_ON(0x0100);             //开始充气
         step=10;
       }                
       break;
       
