zeroWin/BP_MSP430/main.c
     case 10:                                 //判断是否到达预置压力
       if(BP_DC>=Prepressure)
       {
         PUMP_OFF();                  //停止充气，此时匀速泄气阀已经开始泄气
         //delay_s(2);
         delay_times=0;
         BP_MIN=BP_AC_AVE;
         BP_MAX=0;
         last_is_low=1;
         n_P=0;                       //number of points
         step=20;
       }
       break; 
       
     case 20:                                 //将BP_DC和BP_AC通过串口发送                 
       // 只传输此时的采样值
       if(BPSystemStatus == BP_OFFLINE_MEASURE) // 离线测量状态
       {
       }
       if(BPSystemStatus == BP_ONLINE_MEASURE) // 在线测量状态
       {
         SendDCAndACToCC2530(BP_DC,BP_AC,100,100);
//         SendDCAndACToCC2530(aa,aa,100,100);
//         aa++;
//         if(aa==3000)
//           aa = 0;
       }
       if(last_is_low==1)
       {
         if(BP_AC>BP_AC_AVE)
         {
           last_is_low=0;
           Points[n_P].bp=BP_DC;
           delay_times=0;
         }                
       }
       else
       {
         if(BP_MAX<BP_AC)BP_MAX=BP_AC;
         if(BP_AC<BP_AC_AVE && delay_times>=250)
         {
           last_is_low=1;
           BP_P2P=BP_MAX;
           Points[n_P].p2p=BP_MAX;
           if(n_P<99)n_P++;             //number of points
           BP_MAX=BP_AC_AVE;
         }
       }              
       if(BP_DC<930)                  //快速放气
       {
         PUMP_OFF();
         VALVE_ON();
         //delay_s(5);
       }      
       if(BP_DC<300)
       {
         PUMP_OFF();
         VALVE_ON();
         CCTL0 &= ~CCIE;                       //关闭定时器A中断
         step=30;
       }
       break;
     
     default:
       PUMP_OFF();
       VALVE_OFF();
       break;
     }
}


/*****************************************************************************
UART中断服务程序
*****************************************************************************/
#pragma vector=USART0RX_VECTOR
__interrupt void USART0_RX_ISR(void)
{
  static uint8 receiveFlag = 0;
  static uint8 controlMessage = 0;
  Device_waite_time1 = 0;
  uint8 receiveMessage = RXBUF0;
  switch(receiveFlag)
  {
    case 0:
      if(receiveMessage == DATA_START)
        receiveFlag = 1;
      else
        receiveFlag = 0;
      break;
    case 1:
        controlMessage = receiveMessage;
        receiveFlag = 2;
      break;
    case 2:
      if(receiveMessage == DATA_END)
      {
        switch(controlMessage)
        {
          case START_MEASURE: //启动测量命令
            if(BPSystemStatus == BP_ON_SLEEP || BPSystemStatus == BP_ONLINE_IDLE) // 处于睡眠或在线空闲状态
            {
              if(BPSystemStatus == BP_ON_SLEEP)
              {
                LPM0_EXIT;
                HalOledOnOff(HAL_OLED_MODE_ON);
              }
              BPSystemStatus = BP_ONLINE_MEASURE;

              
              HalOledShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
              HalOledShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");   
              Show_Wait_Symbol("On_Go   "); 
              HalOledShowString(0,34,32,"        ");  //8个空格，完全清空               
              Start_BPMeasure();
            }
            break;
            
          case STOP_MEASURE: // 停止测量
            if(BPSystemStatus == BP_ONLINE_MEASURE) //处于在线测量状态
            {
              Stop_BPMeasure();
              BPSystemStatus = BP_ONLINE_IDLE;
              
              HalOledShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
              HalOledShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
              Show_Wait_Symbol("On_IDLE ");    
            }
            break;
            
          case SYNC_MEASURE: // 同步消息，暂不处理
            break;
            
          case FIND_NWK:  // 正在找网消息
            if(BPSystemStatus == BP_ONLINE_MEASURE || BPSystemStatus == BP_OFFLINE_MEASURE) // 如果是正在在线或离线测量
            {
              Stop_BPMeasure();
            }
            if(BPSystemStatus == BP_OFF_SLEEP || BPSystemStatus == BP_ON_SLEEP) // 在线或离线睡眠状态
            {
              LPM0_EXIT;
              HalOledOnOff(HAL_OLED_MODE_ON);      
            }
            BPSystemStatus = BP_FIND_NETWORK;
            HalOledShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
            HalOledShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
            Show_Wait_Symbol("FIND_NWK");    
            break;
            
          case END_DEVICE:  // 找到网络消息 只可能从FIND_NWK到这个状态
            BPSystemStatus = BP_ONLINE_IDLE;
            Show_Wait_Symbol("On_IDLE ");    
            break;
            
          case CLOSEING:   // 正在关闭网络消息
            if(BPSystemStatus == BP_ONLINE_MEASURE) // 在线测量状态关闭网络
              Stop_BPMeasure();
            if(BPSystemStatus == BP_ON_SLEEP) // 睡眠状态下关闭网络
            {
              LPM0_EXIT;
              HalOledOnOff(HAL_OLED_MODE_ON);                 
            }            
            // 在线空闲状态或寻找网络状态下下关闭网络
            // do nothing
            BPSystemStatus = BP_CLOSING;
           
            HalOledShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
            HalOledShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
            Show_Wait_Symbol("CLOSING ");              
            break;
            
          case CLOSE_NWK:
            BPSystemStatus = BP_OFFLINE_IDLE;
            Show_Wait_Symbol("Off_IDLE");          
            break;
            
        }
      }
      receiveFlag = 0;
      break;
  }  
}


/************************************************************************
                        按键控制中断服务程序																                 
*************************************************************************/
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{    
  P1IE &= ~BIT3;                                                         //P1.3 interrupt DISABLE
  Device_waite_time1 = 0;                                                //等待状态计数值清0
  if(BPSystemStatus == BP_OFF_SLEEP || BPSystemStatus == BP_ON_SLEEP)    //处于睡眠态，长按短按都是进入等待态
  {
    LPM0_EXIT;
    if(BPSystemStatus == BP_OFF_SLEEP) // 离线睡眠状态
      BPSystemStatus = BP_OFFLINE_IDLE;     
    if(BPSystemStatus == BP_ONLINE_IDLE) // 在线睡眠状态
      BPSystemStatus = BP_ONLINE_IDLE;    
    HalOledShowString(0,34,32,"        ");  //8个空格，完全清空  “后加的两句用于从休眠返回等待状态时显示空格”
    Show_Wait_Symbol("Off_IDLE");
  }
  else                                                                   //处于等待状态或是测量状态有按键按下
  {
    int Press_type = 0;                                                  //0表示短按，1表示长按
    //判断是长按还是短按
    for(Press_type = 0;Press_type < 1000; ++Press_type)                  //按下约3s
    {
      if(P1IN&BIT3)                                                      //P1.3是高电平，表示松开按键
        break;
      delay_ms(2);
    }
    if(Press_type != 1000)                                               //短按
      Press_type = 0;
    else
      Press_type = 1;                                                    //长按
    if(BPSystemStatus == BP_OFFLINE_IDLE || BPSystemStatus == BP_ONLINE_IDLE) //处于在线/离线空闲状态
    {
      if(Press_type == 0)                                                //短按，开始测量
      {
       
        HalOledShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
        HalOledShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");
        //HalOledShowString(0,34,32,"        ");  //8个空格，完全清空
        if(BPSystemStatus == BP_OFFLINE_IDLE) // 离线空闲状态
        {
          Show_Wait_Symbol("Off_Go  ");
          BPSystemStatus = BP_OFFLINE_MEASURE;
        }
        if(BPSystemStatus == BP_ONLINE_IDLE) // 在线空闲状态
        {
          Show_Wait_Symbol("On_Go   ");
          BPSystemStatus = BP_ONLINE_MEASURE;
        }
        HalOledShowString(0,34,32,"        ");  //8个空格，完全清空             
        Start_BPMeasure();
      }
      else//长按，关屏
      {
        if(BPSystemStatus == BP_OFFLINE_IDLE) // 离线空闲状态
          BPSystemStatus = BP_OFF_SLEEP;
        if(BPSystemStatus == BP_ONLINE_IDLE) // 在线空闲状态
          BPSystemStatus = BP_ON_SLEEP;
       
