zeroWin/BP_MSP430/main.c
void SendDCAndACToCC2530(uint16 DC_temp,uint16 AC_temp,uint16 BP_HIGH_temp,uint16 BP_LOW_temp)
{
  HalBPMeasWriteToBuf(DC_temp);
  HalBPMeasWriteToBuf(AC_temp);
  writeNum++;
  if(writeNum == 16)
  {
    HalBPMeasWriteToBuf(BP_HIGH_temp);
    HalBPMeasWriteToBuf(BP_LOW_temp);
    bufferFullFlag = 1;
    writeNum = 0;
  }
}

void SendBP_HighAndLowoCC2530(uint16 BP_HIGH_temp,uint16 BP_LOW_temp)
{
  uint8 i,bufferSend[68];
  for(i = 0; i < 64; ++i)
    bufferSend[i] = 0xFF;
  
  bufferSend[i++] = (BP_HIGH_temp & 0x00FF);
  bufferSend[i++] = ((BP_HIGH_temp & 0xFF00) >> 8);
  bufferSend[i++] = (BP_LOW_temp & 0x00FF);
  bufferSend[i++] = ((BP_LOW_temp & 0xFF00) >> 8); 
  delay_ms(15);
  UART1_Send_Buffer(bufferSend,68);
  delay_ms(15);
  UART1_Send_Buffer(bufferSend,68);
  delay_ms(15);
  UART1_Send_Buffer(bufferSend,68);
}

void Show_Wait_Symbol(const char *p)
{
    HalOledShowString(SPO2_Symbol_Start_X,0,12,p);
    HalOledShowString(SPO2_Symbol_Start_X+88,0,12,"mmHg");
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X+16,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(SPO2_Wait_Symbol_Start_X+32,SPO2_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X,HR_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X+16,HR_Wait_Symbol_Start_Y,1);
    HalOledShowWaitSymbol(HR_Wait_Symbol_Start_X+32,HR_Wait_Symbol_Start_Y,1);
    
    // 显示电量
    //HalShowBattVol(BATTERY_MEASURE_SHOW);
}




